## 1.14_modify_dataframe_element01

In [1]:
import pandas as pd

In [2]:
exam_data = {"이름" : ["서준","우현","인아"],
            "수학" : [90,80,70],
            "영어" : [98,89,95],
            "음악" : [85,95,100],
            "체육" : [100,90,90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [4]:
# "이름" 이라는 column을 새로운 인덱스로 지정. 원본 데이터에 저장
df.set_index("이름",inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [9]:
# 데이터프레임 df의 특정 원소를 변경하는 방법 - "서준"의 "체육" 점수
df.iloc[0][3] = 80
print(df,"\n")
df.iloc[0,3] = 83
print(df,"\n")
df.loc["서준"]["체육"] = 87
print(df,"\n")
df.loc["서준","체육"] = 89
df

    수학  영어   음악  체육
이름
서준  90  98   85  80
우현  80  89   95  90
인아  70  95  100  90

    수학  영어   음악  체육
이름
서준  90  98   85  83
우현  80  89   95  90
인아  70  95  100  90

    수학  영어   음악  체육
이름
서준  90  98   85  87
우현  80  89   95  90
인아  70  95  100  90

    수학  영어   음악  체육
이름
서준  90  98   85  89
우현  80  89   95  90
인아  70  95  100  90